Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.MeshTopologicalSortFailed Property
 Splitters and grids do not define a consistent rectangular mesh on the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MeshTopologicalSortFailed { get; }
Public Shared ReadOnly Property MeshTopologicalSortFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MeshTopologicalSortFailed {
	FailureDefinitionId^ get ();
}
static member MeshTopologicalSortFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace